In [1]:
from pydataset import data
from scipy import stats
import env
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
import acquire
import prepare
import warnings

In [2]:
untidy = pd.read_sql("select * from attendance", acquire.get_connection('tidy_data'))

In [3]:
untidy

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [21]:
melted_attendence = pd.melt(untidy, id_vars = ["Unnamed: 0"])

In [22]:
melted_attendence

   Unnamed: 0    variable value
0       Sally  2018-01-01     P
1        Jane  2018-01-01     A
2       Billy  2018-01-01     A
3        John  2018-01-01     P
4       Sally  2018-01-02     T
5        Jane  2018-01-02     P
6       Billy  2018-01-02     T
7        John  2018-01-02     T
8       Sally  2018-01-03     T
9        Jane  2018-01-03     T
10      Billy  2018-01-03     A
11       John  2018-01-03     H
12      Sally  2018-01-04     H
13       Jane  2018-01-04     T
14      Billy  2018-01-04     A
15       John  2018-01-04     P
16      Sally  2018-01-05     P
17       Jane  2018-01-05     T
18      Billy  2018-01-05     H
19       John  2018-01-05     P
20      Sally  2018-01-06     A
21       Jane  2018-01-06     T
22      Billy  2018-01-06     T
23       John  2018-01-06     T
24      Sally  2018-01-07     T
25       Jane  2018-01-07     A
26      Billy  2018-01-07     P
27       John  2018-01-07     P
28      Sally  2018-01-08     T
29       Jane  2018-01-08     T
30      Billy  2018-01-08     T
31       John  2018-01-08     P

In [23]:
melted_attendence['value'].replace(['P', 'T', 'H', 'A'],
                        [1, 1, .5, 0], inplace=True)

In [24]:
melted_attendence

   Unnamed: 0    variable  value
0       Sally  2018-01-01    1.0
1        Jane  2018-01-01    0.0
2       Billy  2018-01-01    0.0
3        John  2018-01-01    1.0
4       Sally  2018-01-02    1.0
5        Jane  2018-01-02    1.0
6       Billy  2018-01-02    1.0
7        John  2018-01-02    1.0
8       Sally  2018-01-03    1.0
9        Jane  2018-01-03    1.0
10      Billy  2018-01-03    0.0
11       John  2018-01-03    0.5
12      Sally  2018-01-04    0.5
13       Jane  2018-01-04    1.0
14      Billy  2018-01-04    0.0
15       John  2018-01-04    1.0
16      Sally  2018-01-05    1.0
17       Jane  2018-01-05    1.0
18      Billy  2018-01-05    0.5
19       John  2018-01-05    1.0
20      Sally  2018-01-06    0.0
21       Jane  2018-01-06    1.0
22      Billy  2018-01-06    1.0
23       John  2018-01-06    1.0
24      Sally  2018-01-07    1.0
25       Jane  2018-01-07    0.0
26      Billy  2018-01-07    1.0
27       John  2018-01-07    1.0
28      Sally  2018-01-08    1.0
29       Jane  2018-01-08    1.0
30      Billy  2018-01-08    1.0
31       John  2018-01-08    1.0

In [25]:
#Billy's attendance
billys_attendance =\
melted_attendence[
                  melted_attendence[ 
                                    "Unnamed: 0"] == "Billy"]

In [26]:
billys_attendance

   Unnamed: 0    variable  value
2       Billy  2018-01-01    0.0
6       Billy  2018-01-02    1.0
10      Billy  2018-01-03    0.0
14      Billy  2018-01-04    0.0
18      Billy  2018-01-05    0.5
22      Billy  2018-01-06    1.0
26      Billy  2018-01-07    1.0
30      Billy  2018-01-08    1.0

In [28]:
sum(billys_attendance.value)/8

0.5625